# Pandas 
- Pandas is a fast , powerful , flexible  and easy to use open source data analusis and manipulation tool, built on top of the python 
programming language 
- it is powerful library work on data frames that have 'Relational ' or ' labeled 'data
-its aim aligns with doing real - world  data analaysis using python

Types of Data Structures:
1.Series
2.Dataframe
3.Panel

# to install pandas 
-!pip install pandas


#Series
- Series is a one- dimensional labeled array capable of holding data of any type (integer , string , float, python object , etc)
-the axis labels are collectively called index.
-A pandas Series can be created using the constructor:
     -panda.Series(dara , index , dtype)

In [1]:
# importing libraries
import pandas as pd

In [2]:
# create an empty Series 
pd.Series()

Series([], dtype: object)

# 


Create a Series by lists and ndarray 
- if data in an ndarray , then index passed must be ov the same length 
- id no index is passed , then by default index will be range(n)
    -where n is array length, i.e. [0,1,2,3,............,range(len(array))-1]

In [3]:
import numpy as np 
import pandas as pd

In [4]:
data_list = ['a', 'b', 'c', 'd']
s_list = pd.Series(data_list, index = [101, 102, 103, 104])
s_list

101    a
102    b
103    c
104    d
dtype: object

accesing and slicing

In [5]:
#iloc: for integer index
#loc: for custom index

In [6]:
s_list.iloc[0]

'a'

In [7]:
s_list.loc[101]

'a'

In [8]:
s_list.iloc[0:3]

101    a
102    b
103    c
dtype: object

In [9]:
s_list.loc[101:103]

101    a
102    b
103    c
dtype: object

In [10]:
s_list.iloc[[0,1]]

101    a
102    b
dtype: object

In [11]:
s_list.loc[[101,104]]    # random data lina sakinxa

101    a
104    d
dtype: object

In [12]:
#s_list.loc[101,104]    # list as array ma pathako ho so 2-D hoina

In [13]:
data_array = np.array(['a','b','c','d'])
s_array = pd.Series(data_array)
s_array

0    a
1    b
2    c
3    d
dtype: object

# create a Series from Dictionaries
-A dict can be passed as input and if no index is specified , then the dict keys are taken in a sorted order to construct index.(rows)
- if index is passed , the values in data corresponding to the lavels in the index will be pulled out.

In [14]:
import numpy as np 
import pandas as pd

In [15]:


data_dict= {
    'a': 0,
    'b': 1,
    'c': 2
}
s_dict = pd.Series(data_dict, index = ['b', 'a', 'c'])
s_dict

b    1
a    0
c    2
dtype: int64

# Create a Series from Scalar (fix value)
- if data os a scalar value, an index must be provided.
-the value will be repeated to match the length of index.

In [16]:
pd.Series(data = 5, index= [0,1,2,3,4,5])

0    5
1    5
2    5
3    5
4    5
5    5
dtype: int64

In [17]:

# s_dict[0] : this method is deprciated for future version 
s_dict.iloc[1]

np.int64(0)

#DataFrame


- A DataFrame is a two - dimensional data structure.
-ie. data is aligned in a tabular format in rows and columns
- Potenrially columns are of different types:
    -size: mutable
    -labeled axes (rows, and columns )
    -can perform arithmetic operations on rows and columns wise.
-Pandas DataFrame can be created using constructor:
    -pandas.DataFrame(data, index, columns, rows)

In [18]:
import pandas as pd

In [19]:
#create empty df
print(pd.DataFrame())

Empty DataFrame
Columns: []
Index: []

Create DF usind List

In [20]:
import pandas as pd 
data = [1,2,3,4,5]
df_list = pd.DataFrame(data,columns=['A'])
#print(df_list)

df_list

   A
0  1
1  2
2  3
3  4
4  5

In [21]:
data_nested = [['Alex',10], ['Bob',12],['Harry',15]]
df_nested = pd.DataFrame(data_nested , columns= ['Name','Age'])
df_nested

    Name  Age
0   Alex   10
1    Bob   12
2  Harry   15

# Create DF from dict of ndarrays or lists 
- All the ndarrays must be same length.
- if index is passed , then the length of index should by equal to the length of the arrays . 
- if no index  is passed , then by default , index will be range (n),where n is the array length.

In [22]:
import numpy as np 
import pandas as pd

In [23]:
data = {
    'Name': ['Anil', 'Gokul', 'Mohit', 'Pratyush', 'Yudhir'],
    'Age' : [32,23,43,25,27]
    
}

df= pd.DataFrame(data)
df

       Name  Age
0      Anil   32
1     Gokul   23
2     Mohit   43
3  Pratyush   25
4    Yudhir   27

In [24]:
data = [{'Name':'Anil', 'Age':25},{'Name':'Mohit', 'Age':24} ]
df= pd.DataFrame(data)
df

    Name  Age
0   Anil   25
1  Mohit   24

# create DF using dict of Series.
-dict of Series can be passed to form a DataFrame.
-the resultanf index is the union of all the series indexes passed

In [25]:
# yo ta dict in series garey

import numpy as np
import pandas as pd

data_dict = {
    

    # 'Name': ['Anil', 'Gokul', 'Mohit', 'Pratyush', 'Yudhir'],
    # 'Age' : [32,23,43,25,27]
    
    
}
s_dict = pd.DataFrame(data_dict, index = ['0','1','2','3','4'])
s_dict

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [26]:
 # dict vitra sries lai rakhney
data_series= {
    'one': pd.Series([12,14,15], index =[101,102,103]),

    'two': pd.Series([19,29,39], index =[102,101,103])
    
}
pd.DataFrame(data = data_series)

     one  two
101   12   29
102   14   19
103   15   39

#indexing slicing and accessing

In [27]:
# iloc and loc

In [28]:
df.iloc[1,0]

'Mohit'

In [29]:
df.iloc[1:0]

Empty DataFrame
Columns: [Name, Age]
Index: []

useful method 
-.head()
-.tail()
-.sample()

In [30]:
#.head() : shows top 5 data by default , and if we pass required number it shows those data 
df.head(5)

    Name  Age
0   Anil   25
1  Mohit   24

In [31]:
df.head(12)    # no change if input given

    Name  Age
0   Anil   25
1  Mohit   24

In [32]:
# .sample() : show 1 random data rows by default , pass n values as per your required.
df.sample(2)

    Name  Age
1  Mohit   24
0   Anil   25

In [33]:
import numpy as np
import pandas as pd
data_series = {
    'one' : pd.Series([12,14,15,17,20,39,40,12,55,90,80], index = [101,102,103,104,105,106,107,108,109,110,111]),
    'two' : pd.Series([39,20,19,10,28,12,14,15,17,20,44], index = [101,102,103,104,105,106,107,108,109,110,111])
}
df = pd.DataFrame(data =data_series)
df

     one  two
101   12   39
102   14   20
103   15   19
104   17   10
105   20   28
106   39   12
107   40   14
108   12   15
109   55   17
110   90   20
111   80   44

adding new column to dataframe

In [34]:
names = ['Anil', 'Anit','Mohit','Gokul','Pratyush','Yudhir','Ram','Shyam','Alex','Bishal','Gita']
names

['Anil',
 'Anit',
 'Mohit',
 'Gokul',
 'Pratyush',
 'Yudhir',
 'Ram',
 'Shyam',
 'Alex',
 'Bishal',
 'Gita']

In [35]:
df['names']=  names
df

     one  two     names
101   12   39      Anil
102   14   20      Anit
103   15   19     Mohit
104   17   10     Gokul
105   20   28  Pratyush
106   39   12    Yudhir
107   40   14       Ram
108   12   15     Shyam
109   55   17      Alex
110   90   20    Bishal
111   80   44      Gita

In [36]:
df['names']= names
new_df= df[['names', 'one','two']]
new_df

        names  one  two
101      Anil   12   39
102      Anit   14   20
103     Mohit   15   19
104     Gokul   17   10
105  Pratyush   20   28
106    Yudhir   39   12
107       Ram   40   14
108     Shyam   12   15
109      Alex   55   17
110    Bishal   90   20
111      Gita   80   44

#Initial Information

In [37]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 11 entries, 101 to 111
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   names   11 non-null     object
 1   one     11 non-null     int64
 2   two     11 non-null     int64
dtypes: int64(2), object(1)
memory usage: 352.0+ bytes

In [38]:
# total columns
print(new_df.columns)

#shape of dataframe
print(new_df.shape)

#length of dataframe
print(len(new_df))

Index(['names', 'one', 'two'], dtype='object')
(11, 3)
11

#Stastical Information

In [39]:
#.describe()
new_df.describe(include='all')

       names        one        two
count     11  11.000000  11.000000
unique    11        NaN        NaN
top     Anil        NaN        NaN
freq       1        NaN        NaN
mean     NaN  35.818182  21.636364
std      NaN  28.163161  10.984286
min      NaN  12.000000  10.000000
25%      NaN  14.500000  14.500000
50%      NaN  20.000000  19.000000
75%      NaN  47.500000  24.000000
max      NaN  90.000000  44.000000

adding two numerical columns and form third column

In [40]:
# to change column name 
#inplace = True, enable you to update dataframe
new_df.rename(columns= {'one': 'eng','two': 'nep'}, inplace = True)
new_df

        names  eng  nep
101      Anil   12   39
102      Anit   14   20
103     Mohit   15   19
104     Gokul   17   10
105  Pratyush   20   28
106    Yudhir   39   12
107       Ram   40   14
108     Shyam   12   15
109      Alex   55   17
110    Bishal   90   20
111      Gita   80   44

In [41]:
new_df['Total'] = new_df['eng'] + new_df['nep']
new_df

        names  eng  nep  Total
101      Anil   12   39     51
102      Anit   14   20     34
103     Mohit   15   19     34
104     Gokul   17   10     27
105  Pratyush   20   28     48
106    Yudhir   39   12     51
107       Ram   40   14     54
108     Shyam   12   15     27
109      Alex   55   17     72
110    Bishal   90   20    110
111      Gita   80   44    124

In [42]:
# fetch out students who got above 50 in total

In [43]:
new_df

        names  eng  nep  Total
101      Anil   12   39     51
102      Anit   14   20     34
103     Mohit   15   19     34
104     Gokul   17   10     27
105  Pratyush   20   28     48
106    Yudhir   39   12     51
107       Ram   40   14     54
108     Shyam   12   15     27
109      Alex   55   17     72
110    Bishal   90   20    110
111      Gita   80   44    124

In [44]:
total_50 = new_df[new_df['Total'] > 50][['names','Total']]    #[[]] ma fix value dina rakhna sakinxa 
total_50

      names  Total
101    Anil     51
106  Yudhir     51
107     Ram     54
109    Alex     72
110  Bishal    110
111    Gita    124

In [45]:
# reset index
total_50.reset_index()

   index   names  Total
0    101    Anil     51
1    106  Yudhir     51
2    107     Ram     54
3    109    Alex     72
4    110  Bishal    110
5    111    Gita    124

In [46]:
total_50.reset_index(drop = True, inplace = True)
total_50

    names  Total
0    Anil     51
1  Yudhir     51
2     Ram     54
3    Alex     72
4  Bishal    110
5    Gita    124

In [47]:
#show data above middle 5 people with their names and total 
#accessing & indexing , slicing 
new_df

        names  eng  nep  Total
101      Anil   12   39     51
102      Anit   14   20     34
103     Mohit   15   19     34
104     Gokul   17   10     27
105  Pratyush   20   28     48
106    Yudhir   39   12     51
107       Ram   40   14     54
108     Shyam   12   15     27
109      Alex   55   17     72
110    Bishal   90   20    110
111      Gita   80   44    124

In [48]:
# new_df[3:8][['names']['Total']]

In [49]:
new_df.loc[104:108,['names','Total']]

        names  Total
104     Gokul     27
105  Pratyush     48
106    Yudhir     51
107       Ram     54
108     Shyam     27

In [50]:
ind= new_df[new_df['Total']>50].index
ind

Index([101, 106, 107, 109, 110, 111], dtype='int64')

In [51]:
new_df.loc[ind, ['names', 'eng']].reset_index(drop= True)

    names  eng
0    Anil   12
1  Yudhir   39
2     Ram   40
3    Alex   55
4  Bishal   90
5    Gita   80

# Droping or removing data

In [52]:
new_df.drop(103)     # selected  string lai hatauna use garney (103, axis =1) row ko lagi axis=0

        names  eng  nep  Total
101      Anil   12   39     51
102      Anit   14   20     34
104     Gokul   17   10     27
105  Pratyush   20   28     48
106    Yudhir   39   12     51
107       Ram   40   14     54
108     Shyam   12   15     27
109      Alex   55   17     72
110    Bishal   90   20    110
111      Gita   80   44    124

In [53]:
new_df.drop('eng', axis=1)   # columns ko lagi

        names  nep  Total
101      Anil   39     51
102      Anit   20     34
103     Mohit   19     34
104     Gokul   10     27
105  Pratyush   28     48
106    Yudhir   12     51
107       Ram   14     54
108     Shyam   15     27
109      Alex   17     72
110    Bishal   20    110
111      Gita   44    124

In [54]:
new_df

        names  eng  nep  Total
101      Anil   12   39     51
102      Anit   14   20     34
103     Mohit   15   19     34
104     Gokul   17   10     27
105  Pratyush   20   28     48
106    Yudhir   39   12     51
107       Ram   40   14     54
108     Shyam   12   15     27
109      Alex   55   17     72
110    Bishal   90   20    110
111      Gita   80   44    124

In [55]:
df1 = new_df.drop(index=[101,104,107])    # inplace = True permanent delete garna use vako ho 
df1

        names  eng  nep  Total
102      Anit   14   20     34
103     Mohit   15   19     34
105  Pratyush   20   28     48
106    Yudhir   39   12     51
108     Shyam   12   15     27
109      Alex   55   17     72
110    Bishal   90   20    110
111      Gita   80   44    124

##Functions
4

In [56]:

import pandas as pd
ipl_data={'Team':['Riders','Riders','Devils','Devils','Kings','Kings','Kings','Kings','Riders','Royals','Royals','riders','Riders'],
         'Rank':[1,2,2,3,3,4,1,1,2,4,1,2,1],
         'Year':[2014,2015,2014,2015,2014,2015,None,2017,2016,2014,2015,2017,2014],
         'Points':[876,789,863,673,741,812,756,788,694,701,804,None,876]}
df=pd.DataFrame(ipl_data)
df

      Team  Rank    Year  Points
0   Riders     1  2014.0   876.0
1   Riders     2  2015.0   789.0
2   Devils     2  2014.0   863.0
3   Devils     3  2015.0   673.0
4    Kings     3  2014.0   741.0
5    Kings     4  2015.0   812.0
6    Kings     1     NaN   756.0
7    Kings     1  2017.0   788.0
8   Riders     2  2016.0   694.0
9   Royals     4  2014.0   701.0
10  Royals     1  2015.0   804.0
11  riders     2  2017.0     NaN
12  Riders     1  2014.0   876.0

**to check and handle null values

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Team    13 non-null     object
 1   Rank    13 non-null     int64
 2   Year    12 non-null     float64
 3   Points  12 non-null     float64
dtypes: float64(2), int64(1), object(1)
memory usage: 548.0+ bytes

In [58]:
df.isnull().sum()/len(df)*100   # for the percentage

Team      0.000000
Rank      0.000000
Year      7.692308
Points    7.692308
dtype: float64

In [59]:
# checking null values in a particular rows.
df.isnull().sum(axis=1)/len(df.columns) * 100       # threshold 20 samma handle garna sakinxa

0      0.0
1      0.0
2      0.0
3      0.0
4      0.0
5      0.0
6     25.0
7      0.0
8      0.0
9      0.0
10     0.0
11    25.0
12     0.0
dtype: float64

In [60]:
# to check or display unique values of features
df['Year'].unique()

array([2014., 2015.,   nan, 2017., 2016.])

In [61]:
# to check number of unique values of a feature
df['Year'].nunique()

4

In [62]:
fill_value= df['Year'].mode()[0]  # max values in the frequency
fill_value

np.float64(2014.0)

In [63]:
# display fequency number of each unique values 
df['Year'].value_counts()

Year
2014.0    5
2015.0    4
2017.0    2
2016.0    1
Name: count, dtype: int64

In [64]:
#df['Year'].drop()

In [65]:
df['Year'].dropna()

0     2014.0
1     2015.0
2     2014.0
3     2015.0
4     2014.0
5     2015.0
7     2017.0
8     2016.0
9     2014.0
10    2015.0
11    2017.0
12    2014.0
Name: Year, dtype: float64

In [66]:
# handling null values 
df['Year'].fillna(fill_value)

0     2014.0
1     2015.0
2     2014.0
3     2015.0
4     2014.0
5     2015.0
6     2014.0
7     2017.0
8     2016.0
9     2014.0
10    2015.0
11    2017.0
12    2014.0
Name: Year, dtype: float64

In [67]:
df['Points'].unique()

array([876., 789., 863., 673., 741., 812., 756., 788., 694., 701., 804.,
        nan])

In [68]:
df['Points'].value_counts()

Points
876.0    2
789.0    1
863.0    1
673.0    1
741.0    1
812.0    1
756.0    1
788.0    1
694.0    1
701.0    1
804.0    1
Name: count, dtype: int64

In [69]:
# handling null values of continuous clo by using mean or median 
df['Points'].fillna(df['Points'].mean())

0     876.000000
1     789.000000
2     863.000000
3     673.000000
4     741.000000
5     812.000000
6     756.000000
7     788.000000
8     694.000000
9     701.000000
10    804.000000
11    781.083333
12    876.000000
Name: Points, dtype: float64

In [70]:
df['Points'].fillna(df['Points'].median())

0     876.0
1     789.0
2     863.0
3     673.0
4     741.0
5     812.0
6     756.0
7     788.0
8     694.0
9     701.0
10    804.0
11    788.5
12    876.0
Name: Points, dtype: float64

In [71]:
df['Points'].fillna(df['Points'].median())

0     876.0
1     789.0
2     863.0
3     673.0
4     741.0
5     812.0
6     756.0
7     788.0
8     694.0
9     701.0
10    804.0
11    788.5
12    876.0
Name: Points, dtype: float64

In [72]:
# removing null values from DataFrames
# df.dropna()
# new tedchnique

Duplicated data

In [73]:
# check dupicate
df.duplicated().any()

np.True_

In [74]:
df[df.duplicated(keep = False)]     # entry kati palta vako xa tyo naii duplicate ho

      Team  Rank    Year  Points
0   Riders     1  2014.0   876.0
12  Riders     1  2014.0   876.0

In [75]:
df.duplicated().sum()

np.int64(1)

In [76]:
#drop duplicates
df.drop_duplicates() 
# df.drop_duplicates()   : for permanent deletion

      Team  Rank    Year  Points
0   Riders     1  2014.0   876.0
1   Riders     2  2015.0   789.0
2   Devils     2  2014.0   863.0
3   Devils     3  2015.0   673.0
4    Kings     3  2014.0   741.0
5    Kings     4  2015.0   812.0
6    Kings     1     NaN   756.0
7    Kings     1  2017.0   788.0
8   Riders     2  2016.0   694.0
9   Royals     4  2014.0   701.0
10  Royals     1  2015.0   804.0
11  riders     2  2017.0     NaN

In [77]:
df.describe() 
#df.describe(include = '')

            Rank         Year      Points
count  13.000000    12.000000   12.000000
mean    2.076923  2015.000000  781.083333
std     1.115164     1.128152   70.217142
min     1.000000  2014.000000  673.000000
25%     1.000000  2014.000000  731.000000
50%     2.000000  2015.000000  788.500000
75%     3.000000  2015.250000  824.750000
max     4.000000  2017.000000  876.000000

In [78]:
df.describe( include = 'all')

          Team       Rank         Year      Points
count       13  13.000000    12.000000   12.000000
unique       5        NaN          NaN         NaN
top     Riders        NaN          NaN         NaN
freq         4        NaN          NaN         NaN
mean       NaN   2.076923  2015.000000  781.083333
std        NaN   1.115164     1.128152   70.217142
min        NaN   1.000000  2014.000000  673.000000
25%        NaN   1.000000  2014.000000  731.000000
50%        NaN   2.000000  2015.000000  788.500000
75%        NaN   3.000000  2015.250000  824.750000
max        NaN   4.000000  2017.000000  876.000000

In [79]:
df['Points'].mean()

np.float64(781.0833333333334)

In [80]:
df['Points'].median()

788.5

In [81]:
df['Points'].quantile(0.75)

np.float64(824.75)

In [82]:
 df.describe( include = 'all')[['Team','Year']].tail

<bound method NDFrame.tail of           Team         Year
count       13    12.000000
unique       5          NaN
top     Riders          NaN
freq         4          NaN
mean       NaN  2015.000000
std        NaN     1.128152
min        NaN  2014.000000
25%        NaN  2014.000000
50%        NaN  2015.000000
75%        NaN  2015.250000
max        NaN  2017.000000>

In [83]:
df.describe( include = 'all') .loc[['min','25%','50%','75%']],[['Team','Year']]

(    Team  Rank     Year  Points
 min  NaN   1.0  2014.00  673.00
 25%  NaN   1.0  2014.00  731.00
 50%  NaN   2.0  2015.00  788.50
 75%  NaN   3.0  2015.25  824.75,
 [['Team', 'Year']])

In [84]:
df.describe( include = 'all') .loc['min':'75%'],[['Team','Year']]   # slicing use garera

(    Team  Rank     Year  Points
 min  NaN   1.0  2014.00  673.00
 25%  NaN   1.0  2014.00  731.00
 50%  NaN   2.0  2015.00  788.50
 75%  NaN   3.0  2015.25  824.75,
 [['Team', 'Year']])

Day 3

# changing data types

In [ ]:

# old technique 
df['Year']= df['Year'].astype('int')
df['Points']= df['Points'].astype('int')

In [ ]:
# new technique

# groupby() method

In [87]:
df.groupby('Year')[['Points']].sum()

        Points
Year
2014.0  4057.0
2015.0  3078.0
2016.0   694.0
2017.0   788.0

In [88]:
df.groupby(['Year','Rank'])[['Points']].sum()

             Points
Year   Rank
2014.0 1     1752.0
       2      863.0
       3      741.0
       4      701.0
2015.0 1      804.0
       2      789.0
       3      673.0
       4      812.0
2016.0 2      694.0
2017.0 1      788.0
       2        0.0

In [89]:
import seaborn as sns

In [90]:
tips= sns.load_dataset('tips')
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [91]:
tips.groupby('smoker', observed= True)[['total_bill']].sum()

        total_bill
smoker
Yes        1930.34
No         2897.43

In [92]:
tips.groupby('smoker', observed= True)[['total_bill']].mean()

        total_bill
smoker
Yes      20.756344
No       19.188278

In [93]:
tips.groupby('smoker', observed= True)[['total_bill', 'tip']].median ()

        total_bill   tip
smoker
Yes          17.92  3.00
No           17.59  2.74

#sorting

In [94]:
tips.sort_index(ascending= False)

     total_bill   tip     sex smoker   day    time  size
243       18.78  3.00  Female     No  Thur  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
240       27.18  2.00  Female    Yes   Sat  Dinner     2
239       29.03  5.92    Male     No   Sat  Dinner     3
..          ...   ...     ...    ...   ...     ...   ...
4         24.59  3.61  Female     No   Sun  Dinner     4
3         23.68  3.31    Male     No   Sun  Dinner     2
2         21.01  3.50    Male     No   Sun  Dinner     3
1         10.34  1.66    Male     No   Sun  Dinner     3
0         16.99  1.01  Female     No   Sun  Dinner     2

[244 rows x 7 columns]

In [95]:
tips.sort_values(by = 'total_bill')#.reset_index(drop= True)    : new index assign garxa

     total_bill    tip     sex smoker   day    time  size
67         3.07   1.00  Female    Yes   Sat  Dinner     1
92         5.75   1.00  Female    Yes   Fri  Dinner     2
111        7.25   1.00  Female     No   Sat  Dinner     1
172        7.25   5.15    Male    Yes   Sun  Dinner     2
149        7.51   2.00    Male     No  Thur   Lunch     2
..          ...    ...     ...    ...   ...     ...   ...
182       45.35   3.50    Male    Yes   Sun  Dinner     3
156       48.17   5.00    Male     No   Sun  Dinner     6
59        48.27   6.73    Male     No   Sat  Dinner     4
212       48.33   9.00    Male     No   Sat  Dinner     4
170       50.81  10.00    Male    Yes   Sat  Dinner     3

[244 rows x 7 columns]

In [96]:
tips.sort_values(by= ['sex', 'smoker'], ascending= [True, False])

     total_bill   tip     sex smoker  day    time  size
1         10.34  1.66    Male     No  Sun  Dinner     3
2         21.01  3.50    Male     No  Sun  Dinner     3
3         23.68  3.31    Male     No  Sun  Dinner     2
5         25.29  4.71    Male     No  Sun  Dinner     4
6          8.77  2.00    Male     No  Sun  Dinner     2
..          ...   ...     ...    ...  ...     ...   ...
221       13.42  3.48  Female    Yes  Fri   Lunch     2
225       16.27  2.50  Female    Yes  Fri   Lunch     2
226       10.09  2.00  Female    Yes  Fri   Lunch     2
229       22.12  2.88  Female    Yes  Sat  Dinner     2
240       27.18  2.00  Female    Yes  Sat  Dinner     2

[244 rows x 7 columns]

In [97]:
tips.rename(columns= {'sex': 'gender'})

     total_bill   tip  gender smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

#Pivot

In [98]:
tips.pivot_table(index='sex',values = ['total_bill','tip'], aggfunc= 'mean', observed= True)   # aggfun default nahuda mean use garni> categpries wise nikalney

             tip  total_bill
sex
Male    3.089618   20.744076
Female  2.833448   18.056897

In [99]:
tips.pivot_table(index='sex',columns= ['day','time'],values = ['total_bill','tip'],
                 aggfunc= {'total_bill':'mean', 'tip': 'sum'},              # '\' pani use garna sakinxa new line ko lagi 
                 margins= True, observed= True)

           tip                                              total_bill         \
day       Thur           Fri            Sat     Sun     All       Thur
time     Lunch Dinner  Lunch Dinner  Dinner  Dinner              Lunch Dinner
sex
Male     89.41    NaN   5.70  21.23  181.95  186.78  485.07  18.714667    NaN
Female   79.42    3.0  10.98  14.05   78.45   60.61  246.51  16.648710  18.78
All     168.83    3.0  16.68  35.28  260.40  247.39  731.58  17.664754  18.78


day           Fri                   Sat        Sun        All
time        Lunch     Dinner     Dinner     Dinner
sex
Male    11.386667  23.487143  20.802542  21.887241  20.744076
Female  13.940000  14.310000  19.680357  19.872222  18.056897
All     12.845714  19.663333  20.441379  21.410000  19.785943

In [103]:
tips[(tips['sex']=='Female') & (tips['smoker']=='Yes')][['total_bill']].reset_index()     # selected column de;khauna lai

    index  total_bill
0      67        3.07
1      72       26.86
2      73       25.28
3      92        5.75
4      93       16.32
5     100       11.35
6     101       15.38
7     102       44.30
8     103       22.42
9     109       14.31
10    164       17.51
11    168       10.59
12    169       10.63
13    178        9.60
14    186       20.90
15    188       18.15
16    191       19.81
17    197       43.11
18    198       13.00
19    201       12.74
20    202       13.00
21    203       16.40
22    205       16.47
23    209       12.76
24    213       13.27
25    214       28.17
26    215       12.90
27    219       30.14
28    221       13.42
29    225       16.27
30    226       10.09
31    229       22.12
32    240       27.18